In [10]:
from sklearn.ensemble import RandomForestClassifier
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import OneHotEncoder, LabelEncoder
from sklearn.metrics import accuracy_score, confusion_matrix
from sklearn.compose import ColumnTransformer
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [19]:
df = pd.read_csv("train.csv")
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [20]:
df_test.head()

   Pclass   Age  SibSp  Parch     Fare
0       3  34.5      0      0   7.8292
1       3  47.0      1      0   7.0000
2       2  62.0      0      0   9.6875
3       3  27.0      0      0   8.6625
4       3  22.0      1      1  12.2875

In [21]:
df2 = df.drop(['Name','Ticket','Cabin','PassengerId'],axis=1)
df2.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [22]:
df2.isna().sum()

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Fare          0
Embarked      2
dtype: int64

In [23]:
df3 = df2.dropna()

df3.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [24]:
df3.Embarked.unique()

array(['S', 'C', 'Q'], dtype=object)

In [25]:
label = LabelEncoder()

df3['gender'] = label.fit_transform(df3['Sex'])
df3['embarked'] = label.fit_transform(df3['Embarked'])

df3.head()

<ipython-input-25-de8a08ee6ba7>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3['gender'] = label.fit_transform(df3['Sex'])
<ipython-input-25-de8a08ee6ba7>:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3['embarked'] = label.fit_transform(df3['Embarked'])

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,gender,embarked
0,0,3,male,22.0,1,0,7.2500,S,1,2
1,1,1,female,38.0,1,0,71.2833,C,0,0
2,1,3,female,26.0,0,0,7.9250,S,0,2
3,1,1,female,35.0,1,0,53.1000,S,0,2
4,0,3,male,35.0,0,0,8.0500,S,1,2

In [26]:
df3.drop(['Sex','Embarked'],axis=1,inplace=True)
df3.head()

C:\Users\Admin\anaconda3\lib\site-packages\pandas\core\frame.py:4308: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

   Survived  Pclass   Age  SibSp  Parch     Fare  gender  embarked
0         0       3  22.0      1      0   7.2500       1         2
1         1       1  38.0      1      0  71.2833       0         0
2         1       3  26.0      0      0   7.9250       0         2
3         1       1  35.0      1      0  53.1000       0         2
4         0       3  35.0      0      0   8.0500       1         2

In [27]:
X = df3.drop(['Survived'],axis=1)
y = df3['Survived']

In [28]:
X.head()

   Pclass   Age  SibSp  Parch     Fare  gender  embarked
0       3  22.0      1      0   7.2500       1         2
1       1  38.0      1      0  71.2833       0         0
2       3  26.0      0      0   7.9250       0         2
3       1  35.0      1      0  53.1000       0         2
4       3  35.0      0      0   8.0500       1         2

In [29]:
y.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [30]:
len(X),len(y)

(712, 712)

In [31]:
X_train, X_test, y_train, y_test = train_test_split(X,y,test_size=0.2)

In [32]:
len(X_train),len(y_train),len(X_test),len(y_test)

(569, 569, 143, 143)

In [33]:
log_reg = LogisticRegression()
rforest = RandomForestClassifier()

rforest.fit(X_train,y_train)
log_reg.fit(X_train, y_train)

LogisticRegression()

In [37]:
print("Logistic Regression score is: ",log_reg.score(X_test,y_test))
print("Random Forest Classifier: ",rforest.score(X_test,y_test))

Logistic Regression score is:  0.7902097902097902
Random Forest Classifier:  0.8041958041958042

In [38]:
preds = rforest.predict(X_test)

In [39]:
confusion_matrix(y_test,preds)

array([[79, 17],
       [11, 36]], dtype=int64)